Revit 2024 API
BuiltInFailures.MEPFabricationFailures.FabricationPartInvalidConnection Property
 Fabrication Part connection invalid and could not be automatically coupled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabricationPartInvalidConnection { get; }
Visual Basic
Public Shared ReadOnly Property FabricationPartInvalidConnection As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabricationPartInvalidConnection {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace